Revit 2027 API
DWGExportOptions Methods
The DWGExportOptions type exposes the following members.
Methods
Name | Description
Dispose
(Inherited from BaseExportOptions)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetExportFontTable |  Gets font table.
(Inherited from BaseExportOptions)
GetExportLayerTable |  Gets the layer table.
(Inherited from BaseExportOptions)
GetExportLinetypeTable |  Gets a copy of the line type table.
(Inherited from BaseExportOptions)
GetExportPatternTable |  Gets a copy of the pattern table.
(Inherited from BaseExportOptions)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetPredefinedOptions |  Returns an instance DWGExportOptions containing settings from a predefined export setup.
GetType | Gets the Type of the current instance.
(Inherited from Object)
SetExportFontTable |  Sets font table to option.
(Inherited from BaseExportOptions)
SetExportLayerTable |  Sets layer table back to option
(Inherited from BaseExportOptions)
SetExportLinetypeTable |  Sets the line type table to use during export.
(Inherited from BaseExportOptions)
SetExportPatternTable |  Sets the pattern table to use during export.
(Inherited from BaseExportOptions)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
DWGExportOptions Class
Autodesk.Revit.DB Namespace